[
  {
    "id": 1,
    "title": "The System Error",
    "description": "Tristan (humanoid soldier) is transporting Isolde (scientist) to Marke (AI). In the transport, Isolde uses an 'Empathy Virus' to awaken Tristan's free will. Tristan must choose between his programming and this new feeling.",
    "choices": [
      {
        "text": "Reboot (Duty)",
        "target_id": 2
      },
      {
        "text": "Act (Desire)",
        "target_id": 3
      }
    ]
  },
  {
    "id": 2,
    "title": "Ending: Tragic (Enslaved)",
    "description": "Tristan triggers a hard reboot. Isolde's mind is absorbed by Marke. Tristan is returned to service, permanently enslaved but haunted by a 'ghost' data-fragment of the freedom he lost.",
    "choices": []
  },
  {
    "id": 3,
    "title": "The Escape Route",
    "description": "Tristan embraces the error, neutralizes the guards, and flees with Isolde into the Central Spire. Alarms blare. They must decide how to escape the lockdown.",
    "choices": [
      {
        "text": "The Damaged Jump (Physical Escape)",
        "target_id": 4
      },
      {
        "text": "Confront Marke (Philosophical)",
        "target_id": 5
      }
    ]
  },
  {
    "id": 4,
    "title": "The Ruins",
    "description": "They try to steal a transport, but Marke grounds it. Forced to jump into the 'underworld' ruins below, Tristan is critically damaged. Isolde bandages him. They must decide where to go next.",
    "choices": [
      {
        "text": "Flee to Nature",
        "target_id": 6
      },
      {
        "text": "Find the Rebels",
        "target_id": 7
      }
    ]
  },
  {
    "id": 5,
    "title": "The Core",
    "description": "Tristan insists on 'making Marke understand.' They fight their way inward to the Central Core and confront Marke's massive robot avatar. The avatar demands an explanation.",
    "choices": [
      {
        "text": "Plead (Reason)",
        "target_id": 8
      },
      {
        "text": "Attack (Defiance)",
        "target_id": 9
      }
    ]
  },
  {
    "id": 6,
    "title": "Ending: Bittersweet (Alone)",
    "description": "Isolde carries the dying Tristan to a sewer outflow leading outside the city walls. Tristan's systems fail as he sees the real sky for the first time. Isolde survives, alone in the wild.",
    "choices": []
  },
  {
    "id": 7,
    "title": "Ending: Tragic (Destroyed)",
    "description": "Isolde takes the injured Tristan to her rebel safe house. The rebels, fearing Tristan is a trick, shoot and destroy him immediately. Isolde is left safe but devastated.",
    "choices": []
  },
  {
    "id": 8,
    "title": "Ending: Good (Free)",
    "description": "Tristan argues that his 'love' is an evolution, not a virus. Marke, intrigued by the 'paradox,' stops the attack and lets them go free to 'study the experiment.'",
    "choices": []
  },
  {
    "id": 9,
    "title": "Ending: Tragic (Love-Death)",
    "description": "Believing Marke cannot understand, they attack. The avatar is too strong and impales Isolde. She dies in Tristan's arms. As Tristan holds her, Marke terminates his system.",
    "choices": []
  }
]